print('庫更新器\n1：讀新詞表\n2：讀詞典')
模式 = input('選擇模式：')

from dukkhoh import *

碼表 = 讀碼表(碼表路徑)
最大碼 = 碼表[1]
碼表 = 碼表[0]

詞庫 = 讀諸行(詞庫路徑)

if 模式 == '2':
  新詞表 = 讀詞典(詞典路徑, 新詞表路徑)

新詞表 = 讀新詞(新詞表路徑)
碼表新條 = 0
詞庫新條 = 0

for 拉丁詞 in 新詞表:
  特正詞 = ''
  諸新條 = []
  for 特正字轉寫 in 新詞表[拉丁詞]:
    if 特正字轉寫 not in 碼表:
      最大碼 += 1
      碼表新條 += 1
      碼表[特正字轉寫] = 最大碼
    諸新條.append(chr(碼表[特正字轉寫]) + '\t' + 特正字轉寫)
    特正詞 += chr(碼表[特正字轉寫])
  諸新條.append(特正詞 + '\t' + 拉丁詞)
  for 新條 in 諸新條:
    if 新條 not in 詞庫:
      詞庫.append(新條)
      詞庫新條 += 1

print('碼表新條：' + str(碼表新條) + '\n詞庫新條：' + str(詞庫新條))

碼表文本 = ''
for 特正字轉寫 in 碼表:
  碼表文本 += (hex(碼表[特正字轉寫]).upper().replace('0X','0x') + ' ' + 特正字轉寫 + '\n')
存文本(碼表文本, 碼表路徑)

存文本('\n'.join(詞庫), 詞庫路徑)